

[
  {
    "pImage": "img/scenario2.gif",
    "planetBlurb": "This is planet Zim 34, a lush jungle planet, would you like to travel there?",
    "dialogue": "You have just landed on ZIM 34 after receiving a destress call from a fellow pilot, who has crash landed somewhere on the dense jungle planet. The crew is ready to explore what should you do Captain? ",
    "options": {
      "a": "Ask the locals about the missing pilot",
      "b": "Head towards the smoke emiting from the jungle in the distance",
      "c": "The locals mention a temple?"
    },
    "results": {
      "a": [ "You have consulted the locals and they have offered to take you through the jungle safely to the pilot, they are great hunters and you scored some grub, the captain is happy to see your crew and offers to join your crew",
        3,
        "food"

      ]
    ,
      "b": [ "After a rough and hopeless journey, losing several crew members to the local fauna you made it to the wreckage of the missing captains ship",
        -1,
        "crew member"
      ]
      ,
      "c": [ "You venture forth away from the smoke and flames, telling your crew he is probably already dead... After some heroic acrobatic manoeuvre you stole the jade monkey statue, this will fetch a high price on the intergalactic black market!",
        200,
        "credits"
      ]

    }
  },
  {
    "pImage": "img/scenario1.gif",
    "planetBlurb": "This is planet Palethe 8, planet destruction imminant, would you like to travel there?",
    "dialogue": "Captain there is a strange energy reading coming from Palethe 8, a dry desert planet, my scanners are showing the planet may errupt at any moment, we could save some animals?",
    "options": {
      "a": "The majestic long haired mongoose could be saved?",
      "b": "or the short tempered pigmy dingo?",
      "c": "or the petite bush nosed kangaroo bear?"

    },
    "results": {
      "a": [ "The mongoose rush onto the ship and steal some of your food, mongoose cannot be trusted, everyone knows that captain.",
        -2,
        "food"

      ]
    ,
      "b": [ "You could only find one of the dingoes, as you gaze into his eyes, you hear a voice, 'Hello mortal, I am the spirit animal ka'la'alakfu, please take me away from iminent death' I guess he wants to join the crew!",
        1,
        "crew member"
      ]

      ,
      "c": [ "After a wild chase, the petite bush nosed kangaroo bear brings you to an oasis, it would be a shame to lose all this water to the death of the planet!",
        2,
        "water"
      ]
    }
  },
  {
    "pImage": "img/scenario3.gif",
    "planetBlurb": "Dengel Jar IV, mountains of pink rock salt, locals breathe helium, would you like to travel there?",
    "dialogue": "Some bounty hunters have asked for you help on their mission to find and claim the bounty of one Dingo Jones, last seen on the planet Dengel Jar IV, Shall we land captain?",
    "options": {
      "a": "Visit the local dive bar to find leads, be careful, Dengel Jar IV is full of pirates",
      "b": "The bounty Hunters know of a potential hideout, Lets storm the place!!!",
      "c": "An old family friend, and mystic resides on Dengal Jar IV, pay him a visit?"
    },
    "results": {
      "a": [ "You enter the dive, the sound of high pitched space shanties echo through out the establishment, you strike up a conversation with a local, after making a slight on his high pitched voice, you are asked to leave without your credits, 'Ow, my jaw!'",
        -100,
        "credits"

      ]
    ,
      "b": [ "You signal to your crew member to bust the door down, little did he know that the door was lined with explosives, KABOOM!",
        -1,
        "crew member"
      ]
    ,
    "c": [ "Sugar Haze: At your service, good to see you again captain, hope I can be of some help. ",
      1,
      "crew member"
    ]
    }
  },
  {
    "pImage": "img/scenario4.gif",
    "planetBlurb": "Fisken Zeven is a frozen tundra with minimal signs of life , would you like to travel there?",
    "dialogue": "There is a science research centre on the eastern side of the planet. My data shows that there has been no logs from the scientists in over 6 months. There are caves on the western side that could hold some resources captain.",
    "options": {
      "a": "Investigate the research centre?",
      "b": "Explore the caves?",
      "c": "Scanners show the presence of a bi-pedal robot captain, he could be hostile?"
    },
    "results": {
      "a": [ "After melting down a thick sheet of ice over the door of the research centre, you are greeted by a deranged man, probably one of the scientists, you notice lots of human bones laying around. I guess we should take him with us.",
        1,
        "crew member"

      ]
    ,
      "b": [ "The crew explore the caves and locate a tribe of crystalline, they are peaceful and take the crew to visit their deity, a giant natural gas geyser!",
        3,
        "fuel"
      ]
      ,
      "c": [ "You land the ship and find a metalic figure jutting out of the snow, it is a robot, 'Please, human, let me serve you!' You hoist the robot out of his prison and enters your ship, Welcome aboard! ",
        1,
        "crew member"
      ]

    }
  },
  {
    "pImage": "img/scenario5.gif",
    "planetBlurb": "The red giant Harth 83 is owned by the Harth corporation, now abandoned, home to water farmers, would you like to travel there?",
    "dialogue": "A local farmer has sent out a distress signal, one of his machines has fallen into a crevasse and he cannot get it out by himself, we should help him captain!",
    "options": {
      "a": "Use the ships magnetic hook to drag it out?",
      "b": "Use the front of the ship and boost the machine out with the turbo jets?",
      "c": "Shoot the farmer and take his stuff?"
    },
    "results": {
      "a": [ "The magnetic hook slowly lowers down met with a clunk as it connects to the metal machine, you drag the machine out of the trench and place it back on it's wheels, the farmer is very pleased and offers you some water in return for your services. ",
        5,
        "water"

      ]
    ,
      "b": [ "The ship enters the cravasse and doubles back ramming into the machine smashing it to pieces and a large chunk of the side of the cliff exposing glittering minerals, the farmer cannot believe his eyes, you done struck gold!",
        100,
        "credits"
      ]
      ,
      ,
      "c": [ "The farmer cries as you gun him down, the crew members found a hefty amount of food in the farmers house!",
        5,
        "food"
      ]

    }
  },
  {
    "pImage": "img/scenario6.gif",
    "planetBlurb": "This is planet Gas Dwarf X102, rich in fuel resources, and something else, would you like to travel there?",
    "dialogue": "You reach the planets surface, there are many gas geysers to tap into to gain fuel resources captain, which side should we explore?",
    "options": {
      "a": "My scanners are showing movement on the eastern side of the planet?",
      "b": "There is a geyser over there captain?",
      "c": "The cave over there could be a good option?"
    },
    "results": {
      "a": [ "You find a hive of geyser dwelling ant like creatures, the queen must be producing this vapour, they begin to advance on your crew, you are a threat to their queen! Your crew start shooting the ants, and with an almighty explosion the gas blows the ants to pieces. The left over mess is actually quite tasty.",
        5,
        "food"

      ]
    ,
      "b": [ "Your crew begin tapping the geyser gaining much needed fuel. But, it is cut short when a swarm of gas ants begin advancing on your crew, you escape with a little bit less than you wanted to. ",
        3,
        "fuel"
      ],
      "c": [ "You venture into the cave, only to come to a dead end, journeying back to the ship, you notice giant ant creatures have escaped with your food supplies!",
        -3,
        "food"
      ]

    }
  },
  {
    "pImage": "img/scenario7.gif",
    "planetBlurb": "Planet Magma Vigo II, hot... very hot, would you like to travel there?",
    "dialogue": "You have taken on a job for some smugglers, offering protection to their sensitive cargo being transported to Magma Vigo II, you should receive a handsome reward if the task is performed correctly.",
    "options": {
      "a": "Protect cargo with your life!",
      "b": "Hide in wait for anything fishy?",
      "c": "Secretly inspect the cargo?"
    },
    "results": {
      "a": [ "Your ship hugs closely to the cargo ship as you enter the danger zone, it is an ambush! Space pirates bombard your ship taking major damages and you plummet into the lava!",
        -10,
        "crew member"

      ]
    ,
      "b": [ "You spy the cargo ship on it's way to the drop off, a huge lava waterfall runs parallel to the ship, I giant magma turtle bursts out of the lava and crunches the ship in two! Mission failed.",
        0,
        "credits"
      ],
      "c": [ "You enter the ships cargo bay, inside the box you hear a women crying in a foreign alien tongue, cracking a box open you find a rare female from a near extinct race of Palethisians! You decide to save the women gunning down the smugglers on the way out!",
        1,
        "crew member"
      ]

    }
  },
  {
    "pImage": "img/scenario8.gif",
    "planetBlurb": "This planet is rumored to have come from another dimension, it's a giant coconut, would you like to travel there?",
    "dialogue": "Corporations have been mining the thick outer shell to get to it's rich tasty insides and to harvest the water found within it's core, how shall we proceed?",
    "options": {
      "a": "Use the ship's drill to bore for some water?",
      "b": "Mine for some food?",
      "c": "Syphon fuel from one of the Harth corporation mining machines?"
    },
    "results": {
      "a": [ "The ship's drill cuts into the shell of the planet, spotted by the Harth corporation mercenaries you only escape with a bit of the tasty water",
        4,
        "water"

      ]
    ,
      "b": [ "You planet some explosives to try and bust open the shell of the planet with much success! Coconut chunks rain from the sky!",
        5,
        "food"
      ]
      ,
      "c": [ "Sneaking into the Harth corporation's mining site while the guards are on smoke-o, you manage to syphon quite a bounty!",
        5,
        "fuel"
      ]

    }
  },
  {
    "pImage": "img/scenario9.gif",
    "planetBlurb": "Tranquil's make-up is an interconnected network of trees, would you like to travel there?",
    "dialogue": "Tranquil is well known for it's healing properties and most of the surrounding galaxies have produced medicines and cures for many diseases, perhaps we could find something here?",
    "options": {
      "a": "Explore the forest for rare plant-life?",
      "b": "Explore the mangroves for water-life?",
      "c": "Explore the flower fields?"
    },
    "results": {
      "a": [ "While wondering through the thick forest, you stumble upon a very rare flower, Diamond.ai has catalogued it and located a potential buyer!",
        300,
        "credits"

      ]
    ,
      "b": [ "Entering the mangroves, searching for some rare fauna to sell to collectors, you come across a large mound of earth, the mound opens it's mouth and swallows 2 of your crew members!",
        -2,
        "crew member"
      ],
      "c": [ "The flower fields of Tranquil is one of the 49384 wonders of the universe, with new species of flora sprouting at an alarming rate, Diamond.ai has found a buyer of the rare bouquet!",
        500,
        "credits"
      ]

    }
  },
  {
    "pImage": "img/scenario10.gif",
    "planetBlurb": "Orphen Scale is home to the highly advanced fish-men, would you like to travel there?",
    "dialogue": "There is a civil war breaking out on the planet at the moment, this could be dangerous captain, although with the fish-men distracted by their petty squabbles we could steal some of their highly sought after technology?",
    "options": {
      "a": "Scavenge technology from the dead fish man zone?",
      "b": "Sabotage the Yellow fins base?",
      "c": "Sabotage the Blue fins base?"

    },
    "results": {
      "a": [ "You and your crew enter the battle field rummaging through corpses of giant fish-men from both sides, dodging blasts of energy and large tridents hurtling through the air, you spot a mean looking energy blaster like you have never seen before. Diamond.ai has lined up a buyer!",
        700,
        "credits"

      ]
    ,
      "b": [ "As you sneak into the Yellow fin's base, you begin to plant the explosives in the communications room, a Yellow fin trooper stumbles upon you, but he is actually a Blue fin spy and helps you blow up the room! The king of the Blue fins awards you with many jewels taken from the wealthy Yellow Fins!",
        300,
        "credits"
      ]
    ,
      "c": [ "Sneaking into the Blue fins base you manage to take the King of the Blue fins hostage, demanding treasure for his life! The Blue fins weep and explain that this is why we are waring with the Yellow fins for their treasure. All they have is fish, eh I alright he can live...",
        8,
        "food"
      ]

    }
  },
  {
    "pImage": "img/scenario11.gif",
    "planetBlurb": "This is planet Gas Dwarf X102, would you like to travel there?",
    "dialogue": "The Dwarf gas planet could be rich in fuel resources captain, should we investigate?",
    "options": {
      "a": "What is that smell?",
      "b": "You require more vespene gas?"
    },
    "results": {
      "a": [ "You gained more fuel ",
        5,
        "fuel"

      ]
    ,
      "b": [ "You were attacked by aliens! ",
        -5,
        "crew member"
      ]

    }
  },
{
    "pImage": "img/scenario12.gif",
    "planetBlurb": "This is planet Gas Dwarf X102, would you like to travel there?",
    "dialogue": "The Dwarf gas planet could be rich in fuel resources captain, should we investigate?",
    "options": {
      "a": "What is that smell?",
      "b": "You require more vespene gas?"
    },
    "results": {
      "a": [ "You gained more fuel ",
        5,
        "fuel"

      ]
    ,
      "b": [ "You were attacked by aliens! ",
        -5,
        "crew member"
      ]

    }
  },
  {
    "pImage": "img/scenario13.gif",
    "planetBlurb": "This is planet Gas Dwarf X102, would you like to travel there?",
    "dialogue": "The Dwarf gas planet could be rich in fuel resources captain, should we investigate?",
    "options": {
      "a": "What is that smell?",
      "b": "You require more vespene gas?"
    },
    "results": {
      "a": [ "You gained more fuel ",
        5,
        "fuel"

      ]
    ,
      "b": [ "You were attacked by aliens! ",
        -5,
        "crew member"
      ]

    }
  },
  {
    "pImage": "img/scenario14.gif",
    "planetBlurb": "This is planet Gas Dwarf X102, would you like to travel there?",
    "dialogue": "The Dwarf gas planet could be rich in fuel resources captain, should we investigate?",
    "options": {
      "a": "What is that smell?",
      "b": "You require more vespene gas?"
    },
    "results": {
      "a": [ "You gained more fuel ",
        5,
        "fuel"

      ]
    ,
      "b": [ "You were attacked by aliens! ",
        -5,
        "crew member"
      ]

    }
  },
  {
    "pImage": "img/scenario15.gif",
    "planetBlurb": "This is planet Gas Dwarf X102, would you like to travel there?",
    "dialogue": "The Dwarf gas planet could be rich in fuel resources captain, should we investigate?",
    "options": {
      "a": "What is that smell?",
      "b": "You require more vespene gas?"
    },
    "results": {
      "a": [ "You gained more fuel ",
        5,
        "fuel"

      ]
    ,
      "b": [ "You were attacked by aliens! ",
        -5,
        "crew member"
      ]

    }
  },
  {
    "pImage": "img/scenario16.gif",
    "planetBlurb": "This is planet Gas Dwarf X102, would you like to travel there?",
    "dialogue": "The Dwarf gas planet could be rich in fuel resources captain, should we investigate?",
    "options": {
      "a": "What is that smell?",
      "b": "You require more vespene gas?"
    },
    "results": {
      "a": [ "You gained more fuel ",
        5,
        "fuel"

      ]
    ,
      "b": [ "You were attacked by aliens! ",
        -5,
        "crew member"
      ]

    }
  },
  {
    "pImage": "img/scenario16.gif",
    "planetBlurb": "This is planet Gas Dwarf X102, would you like to travel there?",
    "dialogue": "The Dwarf gas planet could be rich in fuel resources captain, should we investigate?",
    "options": {
      "a": "What is that smell?",
      "b": "You require more vespene gas?"
    },
    "results": {
      "a": [ "You gained more fuel ",
        5,
        "fuel"

      ]
    ,
      "b": [ "You were attacked by aliens! ",
        -5,
        "crew member"
      ]

    }
  },
  {
    "pImage": "img/scenario16.gif",
    "planetBlurb": "This is planet Gas Dwarf X102, would you like to travel there?",
    "dialogue": "The Dwarf gas planet could be rich in fuel resources captain, should we investigate?",
    "options": {
      "a": "What is that smell?",
      "b": "You require more vespene gas?"
    },
    "results": {
      "a": [ "You gained more fuel ",
        5,
        "fuel"

      ]
    ,
      "b": [ "You were attacked by aliens! ",
        -5,
        "crew member"
      ]

    }
  }



]

